<a href="https://colab.research.google.com/github/Akshat977/Applied-Data-Science-Capstone-Coursera-/blob/main/The__Battle_Of_Two_Cities.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd
import folium
from geopy.geocoders import Nominatim
from pandas.io.json import json_normalize

In [20]:
#df_delhi=pd.read_csv('delhi_dataSet.csv')
#df_delrest=pd.read_csv('restaurant_dataSet.csv')
df_delhi.head()

   Unnamed: 0           Borough  Neighborhood   latitude  longitude
0           0  North West Delhi  Adarsh Nagar  28.614192  77.071541
1           1  North West Delhi   Ashok Vihar  28.699453  77.184826
2           2  North West Delhi       Azadpur  28.707657  77.175547
3           3  North West Delhi        Bawana  28.799660  77.032885
4           4  North West Delhi     Begum Pur        NaN        NaN

In [19]:
#df_delrest.columns=['this','Neighborhood','Neighborhood lat','Neighborhoof lon','Venue','Venue lat','Venue lon','Venue category']
#df_delrest.drop(['this'],axis=1,inplace=True)
print(df_delhi.shape,df_delrest.shape)
df_delrest.head()

(185, 5) (849, 7)

   Neighborhood  Neighborhood lat  ...  Venue lon        Venue category
0  Adarsh Nagar         28.614193  ...  77.070784           Pizza Place
1  Adarsh Nagar         28.614193  ...  77.076084     Indian Restaurant
2  Adarsh Nagar         28.614193  ...  77.066978  Fast Food Restaurant
3  Adarsh Nagar         28.614193  ...  77.067034  Fast Food Restaurant
4   Ashok Vihar         28.699453  ...  77.187832     Indian Restaurant

[5 rows x 7 columns]

In [25]:
#df_mumbai_unfiltered=pd.read_csv('mumbai.csv')
#df_mumbai_unfiltered.head()
#df_mumbai=df_mumbai_unfiltered.drop(['officeType','Deliverystatus','divisionname','circlename','Taluk','Districtname','statename','Telephone','Related Suboffice','Related Headoffice'],axis=1)
#deleting all other data other than the data containing mumbai from df_mumbai:
#df_mumbai=df_mumbai[df_mumbai['regionname']=='Mumbai']
#df_mumbai['officename'] = df_mumbai['officename'].str.rstrip('S.O.')
#df_mumbai['officename'] = df_mumbai['officename'].str.rstrip('B.O.')
#df_mumbai['officename'] = df_mumbai['officename'].str.rstrip('H.O.')

In [26]:
df_mumbai.reset_index(drop=True,inplace=True)
df_mumbai.head()

             officename  pincode regionname  longitude  latitude
0           Antop Hill    400037     Mumbai        NaN       NaN
1         B P T Colony    400037     Mumbai        NaN       NaN
2             B.P.Lane    400003     Mumbai        NaN       NaN
3  BEST STaff Quarters    400012     Mumbai        NaN       NaN
4         C G S Colony    400037     Mumbai        NaN       NaN

In [28]:
df_mumbai.isnull().sum()

officename       0
pincode          0
regionname       0
longitude     1123
latitude      1123
dtype: int64

In [29]:
address='Antop Hill, Mumbai'

location=geolocator.geocode(address)
print(location.latitude,location.longitude)

19.0207608 72.8652556

In [ ]:
lon,lat=list(),list()
for index,row in df_mumbai.iterrows():
  address='{}, Mumbai'.format(row['officename'])
  geolocator=Nominatim(user_agent='foursquare_agent')
  try:
    location=geolocator.geocode(address)
    lat.append(location.latitude)
    lon.append(location.longitude)
  except:
    lat.append(np.nan)
    lon.append(np.nan)

df_mumbai['latitude']=lat
df_mumbai['longitude']=lon
df_mumbai.head()